[M_Orchid_PlotMission08 MissionDefinition]
MissionName="Que Se Faça A Luz"
MissionDescription="Agora que você encontrou todas as partes da bússola do Capitão Blade, só resta fazer uma coisa: levar a bússola que você montou até o [place]Farol Magnys[-place]. Scarlett disse que se a bússola do Blade for ativada no topo do farol, a localização do tesouro das areias será revelada.\n"
TurnInDescription="A localização do tesouro perdido foi revelada! Não fique aí parado!\n"
MissionSummary="Leve a bússola do Capitão Blade até o Farol Magnys.\n"
MissionGiver="Capitã Scarlett"
MissionTurnInLocation="Farol Magnys"
TeaserText=""

[M_Orchid_PlotMission08:ActivateBeacon MissionObjectiveDefinition]
ProgressMessage="Ative o farol"

[M_Orchid_PlotMission08:ActivateBeaconSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:ActivateBeaconSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:Activatelift MissionObjectiveDefinition]
ProgressMessage="Ative o elevador"

[M_Orchid_PlotMission08:ActivateLiftSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:AssembleCompass MissionObjectiveDefinition]
ProgressMessage="Monte a bússola do Capitão Blade"

[M_Orchid_PlotMission08:AssembleCompassSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:Dummy MissionObjectiveDefinition]
ProgressMessage=""

[M_Orchid_PlotMission08:DummySet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:FindWayUp MissionObjectiveDefinition]
ProgressMessage="Encontre um jeito de subir"

[M_Orchid_PlotMission08:FindWayUpSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:GotoLighthouse MissionObjectiveDefinition]
ProgressMessage="Entre no Farol Magnys"

[M_Orchid_PlotMission08:GotoLighthouseSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:GotoLighthouseSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:GotoSpireSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:InsertCompass MissionObjectiveDefinition]
ProgressMessage="Posicione a bússola"

[M_Orchid_PlotMission08:InsertCompassSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:Opengate MissionObjectiveDefinition]
ProgressMessage="Ative a porta"

[M_Orchid_PlotMission08:OpenGateSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:TakeCompass MissionObjectiveDefinition]
ProgressMessage="Pegue a bússola montada"

[M_Orchid_PlotMission08:TakeCompassPiece MissionObjectiveDefinition]
ProgressMessage="Pegue a parte da bússola da Scarlett"

[M_Orchid_PlotMission08:TakeCompassPieceSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:TakeCompassSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:UseLift MissionObjectiveDefinition]
ProgressMessage="Use o elevador"

[M_Orchid_PlotMission08:UseLiftSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission08:WaitForLift MissionObjectiveDefinition]
ProgressMessage="Espere o elevador"

[M_Orchid_PlotMission08:WaitForLiftSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

